app/views/character/edit.html.erb

SELECT "items".* FROM "items"
---
                <%= f.label :item%>
                <%= f.select :item_id, @item.map { |t| [t.name]}, {}, class: "item"%>