app/views/character/index.html.erb

SELECT "items".* FROM "items"
---
								<%= form.label :item%>
								<%= form.select :item_id, @item.map { |t| [t.name]}, {}, class: "item" %>