app/controllers/character_controller.rb

SELECT "items".* FROM "items"
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "characters".* FROM "characters"
---
    def index
        @item = Item.all
        user = User.find_by_id(session[:user_id])
        if user.isAdmin == true
            @characters = Character.all

INSERT INTO "characters" ("name", "classe", "str", "dex", "int", "con", "wis", "cha", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "histories" ("history", "city", "race", "characteristics", "character_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["history", "a"], ["city", "a"], ["race", "a"], ["characteristics", "a"], ["character_id", 20], ["created_at", "2023-06-23 00:10:48.140708"], ["updated_at", "2023-06-23 00:10:48.140708"]]
SELECT "items".* FROM "items" WHERE "items"."name" = ? LIMIT ?  [["name", "sword"], ["LIMIT", 1]]
INSERT INTO "characters" ("name", "classe", "str", "dex", "int", "con", "wis", "cha", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @character = Character.create(character_params)
        @character.user = User.find_by_id(session[:user_id])
        @history = History.create(history_params)
        item = Item.find_by_name(params[:item_id])

        if @character.valid? && item.valid?
            @character.items << item
            item.characters << @character

SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "characters" WHERE "characters"."id" = ?  [["id", 12]]
---
    def destroy
        character = Character.find(params[:id])
        if character.destroy!

SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
SELECT "histories".* FROM "histories" WHERE "histories"."character_id" = ? LIMIT ?  [["character_id", 13], ["LIMIT", 1]]
UPDATE "histories" SET "race" = ?, "updated_at" = ? WHERE "histories"."id" = ?  [["race", "aaaaa"], ["updated_at", "2023-06-24 03:58:00.313826"], ["id", 1]]
UPDATE "characters" SET "classe" = ?, "updated_at" = ? WHERE "characters"."id" = ?  [["classe", "teste"], ["updated_at", "2023-06-24 03:50:36.357340"], ["id", 1]]
---
    def update
        @character = Character.find(params[:id])
        @history = History.find_by_character_id(@character.id)
        if @character.update(params.require(:character).permit(:name, :classe, :str, :dex, :int, :con, :wis, :cha))
            if @history.update(params.require(:character).permit(:history, :city, :characteristics, :race))

SELECT "items".* FROM "items"
SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "characters_items".* FROM "characters_items" WHERE (1) LIMIT ?  [["LIMIT", 1]]
SELECT "histories".* FROM "histories" WHERE "histories"."character_id" = ? LIMIT ?  [["character_id", 1], ["LIMIT", 1]]
---
    def edit
        @item = Item.all
        @character = Character.find(params[:id])
        @itemCharacter = CharactersItem.find_by(params[:id])
        @history = History.find_by_character_id(@character.id)