app/controllers/register_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("name", "email", "password", "isAdmin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", nil], ["email", nil], ["password", "[FILTERED]"], ["isAdmin", nil], ["created_at", "2023-06-21 17:24:59.004611"], ["updated_at", "2023-06-21 17:24:59.004611"]]